package common;

//결과 : 두 컴퓨터가 원카드 하는 것

//카드 종류 : 49(1) 50(2) 51(3) 52(4) 53(5) 54(6) 55(7) 56(8) 57(9) 75(K) 74(J) 81(Q) X 35(#) 64(@)
//룰
// 숫자와 패턴을 각각 char로 지정한다 총 카드는 9*2 = 18개, 각각 6개씩 들고 시작, 중앙패 12개
// 숫자와 패턴은 둘이 한 세트가 되어야함.
/* 각각 p1/p2의 카드 1의 n/p ... 카드6의 n/p 구분
 * p1, p2, 중앙 각각 소주할 수 있는 카드 목록 max 18개 
 * 시작할 때 각각 플레이어의 카드1에서 6까지 숫자와 패턴을 넣어준다.
 *
 * 
 * 
 * */

public class OneCard {
	public static void main(String[] args) {

		for(int i=0 ; i<9 ; i++)
		{

		}
	}
}
